ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4NR/device/TMPM4NR.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __CM4_REV 0x0001 /*!< Cortex-M4 Core Revision */
#define __MPU_PRESENT 1 /*!< MPU present or not */
#define __FPU_PRESENT 1 /*!< FPU present or not */
#define __NVIC_PRIO_BITS 4 /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig 0 /*!< Set to 1 if different SysTick Config is used */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals            */
#include "system_TMPM4Nx.h"                 /* TMPM4Nx System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
typedef struct {
    __I  uint32_t INTSTATUS;         /*!< DMAC Interrupt Status Register               */
    __I  uint32_t INTTCSTATUS;       /*!< DMAC Transfer Completion Interrupt Status Register*/
    __O  uint32_t INTTCCLEAR;        /*!< DMAC Transfer Completion Interrupt Clear Register*/
    __I  uint32_t INTERRORSTATUS;    /*!< DMAC Error Interrupt Status Register         */
    __O  uint32_t INTERRCLR;         /*!< DMAC Error Interrupt Clear Register          */
    __I  uint32_t RAWINTTCSTATUS;    /*!< DMAC Raw Transfer Completion Interrupt Status Register*/
    __I  uint32_t RAWINTERRORSTATUS; /*!< DMAC Raw Error Interrupt Status Register     */
    __I  uint32_t ENBLDCHNS;         /*!< DMAC Channel Enable Register                 */
    __IO uint32_t SOFTBREQ;          /*!< DMAC Software Burst Transfer Request Register*/
    __IO uint32_t SOFTSREQ;          /*!< DMAC Software Single Transfer Request Register*/
    uint32_t RESERVED0[2];
    __IO uint32_t CONFIGURATION;     /*!< DMAC Configuration Register                  */
    uint32_t RESERVED1[51];
    __IO uint32_t C0SRCADDR;         /*!< DMAC Channel 0 Transfer Source Address Register*/
    __IO uint32_t C0DESTADDR;        /*!< DMAC Channel 0 Transfer Destination Address Register*/
    __IO uint32_t C0LLI;             /*!< DMAC Channel 0 Linked List Item Register     */
    __IO uint32_t C0CONTROL;         /*!< DMAC Channel 0 Control Register              */
    __IO uint32_t C0CONFIGURATION;   /*!< DMAC Channel 0 Configuration Register        */
    uint32_t RESERVED2[3];
    __IO uint32_t C1SRCADDR;         /*!< DMAC Channel 1 Transfer Source Address Register*/
    __IO uint32_t C1DESTADDR;        /*!< DMAC Channel 1 Transfer Destination Address Register*/
    __IO uint32_t C1LLI;             /*!< DMAC Channel 1 Linked List Item Register     */
    __IO uint32_t C1CONTROL;         /*!< DMAC Channel 1 Control Register              */
    __IO uint32_t C1CONFIGURATION;   /*!< DMAC Channel 1 Configuration Register        */
} TSB_DMAC_TypeDef;

/**
  * @brief CAN Controller Mailbox RAM (CANMB)
  */
typedef struct {
    __IO uint32_t ID;                /*!< CAN Message ID Field Register                */
    uint32_t RESERVED0;
    __IO uint32_t TSVMCF;            /*!< CAN Time Stamp Values/ Message Control Filed Register*/
    uint32_t RESERVED1;
    __IO uint32_t DL;                /*!< CAN Data Filed Register (DL)                 */
    uint32_t RESERVED2;
    __IO uint32_t DH;                /*!< CAN Data Filed Register (DH)                 */
} TSB_CANAMB_TypeDef;

/**
  * @brief CAN Controller Mailbox RAM (CANMB)
  */
typedef struct {
    __IO uint32_t ID;                /*!< CAN Message ID Field Register                */
    uint32_t RESERVED0;
    __IO uint32_t TSVMCF;            /*!< CAN Time Stamp Values/ Message Control Filed Register*/
    uint32_t RESERVED1;
    __IO uint32_t DL;                /*!< CAN Data Filed Register (DL)                 */
    uint32_t RESERVED2;
    __IO uint32_t DH;                /*!< CAN Data Filed Register (DH)                 */
} TSB_CANBMB_TypeDef;

/**
  * @brief CAN Controller (CAN)
  */
typedef struct {
    __IO uint32_t MC;                /*!< CAN Mailbox Configuration Register           */
    uint32_t RESERVED0;
    __IO uint32_t MD;                /*!< CAN Mailbox Direction Register               */
    uint32_t RESERVED1;
    __IO uint32_t TRS;               /*!< CAN Transmission Request Set Register        */
    uint32_t RESERVED2;
    __IO uint32_t TRR;               /*!< CAN Transmission Request Reset Register      */
    uint32_t RESERVED3;
    __IO uint32_t TA;                /*!< CAN Transmission Acknowledge Register        */
    uint32_t RESERVED4;
    __IO uint32_t AA;                /*!< CAN Abort Acknowledge Register               */
    uint32_t RESERVED5;
    __IO uint32_t RMP;               /*!< CAN Receive Message Pending Register         */
    uint32_t RESERVED6;
    __IO uint32_t RML;               /*!< CAN Receive Message Lost Register            */
    uint32_t RESERVED7;
    __IO uint32_t LAM;               /*!< CAN Local Acceptance Mask Register           */
    uint32_t RESERVED8;
    __IO uint32_t GAM;               /*!< CAN Global Acceptance Mask Register          */
    uint32_t RESERVED9;
    __IO uint32_t MCR;               /*!< CAN Master Control Register                  */
    uint32_t RESERVED10;
    __I  uint32_t GSR;               /*!< CAN Global Status Register                   */
    uint32_t RESERVED11;
    __IO uint32_t BCR1;              /*!< CAN Bit Configuration Register 1             */
    uint32_t RESERVED12;
    __IO uint32_t BCR2;              /*!< CAN Bit Configuration Register 2             */
    uint32_t RESERVED13;
    __IO uint32_t GIF;               /*!< CAN Global Interrupt Flag Register           */
    uint32_t RESERVED14;
    __IO uint32_t GIM;               /*!< CAN Global Interrupt Mask Register           */
    uint32_t RESERVED15;
    __IO uint32_t MBTIF;             /*!< CAN Mailbox Transmit Interrupt Flag Register */
    uint32_t RESERVED16;
    __IO uint32_t MBRIF;             /*!< CAN Mailbox Receive Interrupt Flag Register  */
    uint32_t RESERVED17;
    __IO uint32_t MBIM;              /*!< CAN Mailbox Interrupt Mask Register          */
    uint32_t RESERVED18;
    __IO uint32_t CDR;               /*!< CAN Change Data Request Register             */
    uint32_t RESERVED19;
    __IO uint32_t RFP;               /*!< CAN Remote Frame Pending Register            */
    uint32_t RESERVED20;
    __IO uint32_t CEC;               /*!< CAN Error Counter Register                   */
    uint32_t RESERVED21;
    __IO uint32_t TSP;               /*!< CAN Time Stamp Counter Prescaler Register    */
    uint32_t RESERVED22;
    __I  uint32_t TSC;               /*!< CAN Time Stamp Counter Register              */
} TSB_CAN_TypeDef;

/**
  * @brief Ether Mac
  */
typedef struct {
    __IO uint32_t TMAC_CONFIGURATION;/*!< TMAC Configuration Register                  */
    __IO uint32_t TMAC_FRAME_FILTER; /*!< TMAC Frame Filter Register                   */
    __IO uint32_t HASH_TABLE_HIGH;   /*!< Hash Table High Register                     */
    __IO uint32_t HASH_TABLE_LOW;    /*!< Hash Table Low Register                      */
    __IO uint32_t MII_ADDRESS;       /*!< MII Address Register                         */
    __IO uint32_t MII_DATA;          /*!< MII Data Register                            */
    __IO uint32_t FLOW_CONTROL;      /*!< Flow Control Register                        */
    __IO uint32_t VLAN_TAG;          /*!< VLAN Tag Register                            */
    uint32_t RESERVED0;
    __I  uint32_t DEBUG;             /*!< Debug Register                               */
    __IO uint32_t REMOTE_WAKE_UP_FRAME_FILTER;/*!< Remote Wake-Up Frame Filter Register         */
    __IO uint32_t PMT_CONTROL_STATUS;/*!< PMT Control and Status Register              */
    uint32_t RESERVED1[2];
    __I  uint32_t INTERRUPT_STATUS;  /*!< Interrupt Status Register                    */
    __IO uint32_t INTERRUPT_MASK;    /*!< Interrupt Mask Register                      */
    __IO uint32_t MAC_ADDRESS0_HIGH; /*!< MAC Address0 High Register                   */
    __IO uint32_t MAC_ADDRESS0_LOW;  /*!< MAC Address0 Low Register                    */
    __IO uint32_t MAC_ADDRESS1_HIGH; /*!< MAC Address1 High Register                   */
    __IO uint32_t MAC_ADDRESS1_LOW;  /*!< MAC Address1 Low Register                    */
    __IO uint32_t MAC_ADDRESS2_HIGH; /*!< MAC Address2 High Register                   */
    __IO uint32_t MAC_ADDRESS2_LOW;  /*!< MAC Address2 Low Register                    */
    __IO uint32_t MAC_ADDRESS3_HIGH; /*!< MAC Address3 High Register                   */
    __IO uint32_t MAC_ADDRESS3_LOW;  /*!< MAC Address3 Low Register                    */
    uint32_t RESERVED2[31];
    __IO uint32_t WDOG_TIMEOUT;      /*!< Watchdog Timeout Register                    */
    uint32_t RESERVED3[8];
    __IO uint32_t MMC_CONTROL;       /*!< MMC Control Register                         */
    __I  uint32_t MMC_RECEIVE_INTERRUPT;/*!< MMC Receive Interrupt Register               */
    __I  uint32_t MMC_TRANSMIT_INTERRUPT;/*!< MMC Transmit Interrupt Register              */
    __IO uint32_t MMC_RECEIVE_INTERRUPT_MASK;/*!< MMC Receive Interrupt Mask Register          */
    __IO uint32_t MMC_TRANSMIT_INTERRUPT_MASK;/*!< MMC Transmit Interrupt Mask Register         */
    uint32_t RESERVED4;
    __I  uint32_t TX_FRAME_COUNT_GOOD_BAD;/*!< Transmit Frame Count for Good and Bad Frames Register*/
    uint32_t RESERVED5[11];
    __I  uint32_t TX_UNDERFLOW_ERROR_FRAMES;/*!< Transmit Frame Count for Underflow Error Frames Register*/
    __I  uint32_t TX_SINGLE_COLLISION_GOOD_FRAMES;/*!< Transmit Frame Count for Frames Transmitted after Single Collision Register*/
    __I  uint32_t TX_MULTIPLE_COLLISION_GOOD_FRAMES;/*!< Transmit Frame Count for Frames Transmitted after Multiple Collision Register*/
    uint32_t RESERVED6[5];
    __I  uint32_t TX_FRAME_COUNT_GOOD;/*!< Transmit Frame Count for Good Frames Register*/
    uint32_t RESERVED7[5];
    __I  uint32_t RX_FRAMES_COUNT_GOOD_BAD;/*!< Receive Frame Count for Good and Bad Frames Register*/
    uint32_t RESERVED8[4];
    __I  uint32_t RX_CRC_ERROR_FRAMES;/*!< Receive Frame Count for CRC Error Frames Register*/
    __I  uint32_t RX_ALIGNMENT_ERROR_FRAMES;/*!< Receive Frame Count for Alignment Error Frames Register*/
    uint32_t RESERVED9[10];
    __I  uint32_t RX_UNICAST_FRAMES_GOOD;/*!< Receive Frame Count for Good Unicast Frames Register*/
    uint32_t RESERVED10[3];
    __I  uint32_t RX_FIFO_OVERFLOW_FRAMES;/*!< Receive Frame Count for FIFO Overflow Frames Register*/
    uint32_t RESERVED11[10];
    __IO uint32_t MMC_IPC_RECEIVE_INTERRUPT_MASK;/*!< MMC Receive Checksum Offload Interrupt Mask Register*/
    uint32_t RESERVED12;
    __I  uint32_t MMC_IPC_RECEIVE_INTERRUPT;/*!< MMC Receive Checksum Offload Interrupt Register*/
    uint32_t RESERVED13[13];
    __I  uint32_t RXICMP_GOOD_FRAMES;/*!< Receive ICMP Good Frame Counter Register     */
    __I  uint32_t RXICMP_ERROR_FRAMES;/*!< Receive ICMP Error Frame Counter Register    */
    uint32_t RESERVED14[207];
    __IO uint32_t VLAN_INCL_REG;     /*!< VLAN Tag Inclusion or Replacement Register   */
    __IO uint32_t VLAN_HASH_TABLE_REG;/*!< VLAN Hash Table Register                     */
    uint32_t RESERVED15[93];
    __IO uint32_t TIMESTAMP_CONTROL; /*!< Timestamp Control Register                   */
    __IO uint32_t SUB_SECOND_INCREMENT;/*!< Sub-Second Increment Register                */
    __I  uint32_t SYSTEM_TIME_SECONDS;/*!< System Time - Seconds Register               */
    __I  uint32_t SYSTEM_TIME_NANOSECONDS;/*!< System Time - Nanoseconds Register           */
    __IO uint32_t SYSTEM_TIME_SECONDS_UPDATE;/*!< System Time - Seconds Update Register        */
    __IO uint32_t SYSTEM_TIME_NANOSECONDS_UPDATE;/*!< System Time - Nanoseconds Update Register    */
    __IO uint32_t TIMESTAMP_ADDEND;  /*!< Timestamp Addend Register                    */
    __IO uint32_t TARGET_TIME_SECONDS;/*!< Target Time Seconds Register                 */
    __IO uint32_t TARGET_TIME_NANOSECONDS;/*!< Target Time Nanoseconds Register             */
    __IO uint32_t SYSTEM_TIME_HIGHER_WORD_SECONDS;/*!< System Time - Higher Word Seconds Register   */
    __I  uint32_t TIMESTAMP_STATUS;  /*!< Timestamp Status Register                    */
    __IO uint32_t PPS_CONTROL;       /*!< PPS Control Register                         */
    uint32_t RESERVED16[12];
    __IO uint32_t PPS0_INTERVAL;     /*!< PPS0 Interval Register                       */
    __IO uint32_t PPS0_WIDTH;        /*!< PPS0 Width Register                          */
    uint32_t RESERVED17[6];
    __IO uint32_t PPS1_TARGET_TIME_SECONDS;/*!< PPS1 Target Time Seconds Register            */
    __IO uint32_t PPS1_TARGET_TIME_NANOSECONDS;/*!< PPS1 Target Time NanoSeconds Register        */
    __IO uint32_t PPS1_INTERVAL;     /*!< PPS1 Interval Register                       */
    __IO uint32_t PPS1_WIDTH;        /*!< PPS1 Width Register                          */
    uint32_t RESERVED18[540];
    __IO uint32_t BUS_MODE;          /*!< Bus Mode Register                            */
    __IO uint32_t TRANSMIT_POLL_DEMAND;/*!< Transmit Poll Demand Register                */
    __IO uint32_t RECEIVE_POLL_DEMAND;/*!< Receive Poll Demand Register                 */
    __IO uint32_t RECEIVE_DESCRIPTOR_LIST_ADDRESS;/*!< Receive Descriptor List Address Register     */
    __IO uint32_t TRANSMIT_DESCRIPTOR_LIST_ADDRESS;/*!< Transmit Descriptor List Address Register    */
    __IO uint32_t STATUS;            /*!< Status Register                              */
    __IO uint32_t OPERATION_MODE;    /*!< Operation Mode Register                      */
    __IO uint32_t INTERRUPT_ENABLE;  /*!< Interrupt Enable Register                    */
    __I  uint32_t MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER;/*!< Missed Frame and Buffer Overflow Counter Register*/
    __IO uint32_t RECEIVE_INTERRUPT_WATCHDOG_TIMER;/*!< Receive Interrupt Watchdog Timer Register    */
    uint32_t RESERVED19;
    __I  uint32_t AHB_STATUS;        /*!< AHB Status Register                          */
    uint32_t RESERVED20[6];
    __I  uint32_t CURRENT_HOST_TRANSMIT_DESCRIPTOR;/*!< Current Host Transmit Descriptor Register    */
    __I  uint32_t CURRENT_HOST_RECEIVE_DESCRIPTOR;/*!< Current Host Receive Descriptor Register     */
    __I  uint32_t CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS;/*!< Current Host Transmit Buffer Address Register*/
    __I  uint32_t CURRENT_HOST_RECEIVE_BUFFER_ADDRESS;/*!< Current Host Receive Buffer Address Register */
    uint32_t RESERVED21[490];
    __IO uint32_t MAC_CTRL0;         /*!< Ether Mac Control Register 0                 */
    __IO uint32_t MAC_CTRL1;         /*!< Ether Mac Control Register 1                 */
    __IO uint32_t MAC_CTRL2;         /*!< Ether Mac Control Register 2                 */
} TSB_EM_TypeDef;

/**
  * @brief SMIF
  */
typedef struct {
    __IO uint32_t MAP0;              /*!< SMIF Address Map Control Register 0          */
    __IO uint32_t MAP1;              /*!< SMIF Address Map Control Register 1          */
    __IO uint32_t DACR0;             /*!< SMIF Direct Access Control Register 0        */
    __IO uint32_t DACR1;             /*!< SMIF Direct Access Control Register 1        */
    __IO uint32_t DRCR0;             /*!< SMIF Direct Read Control Register 0          */
    __IO uint32_t DRCR1;             /*!< SMIF Direct Read Control Register 1          */
    __IO uint32_t DWCR0;             /*!< SMIF Direct Write Control Register 0         */
    __IO uint32_t DWCR1;             /*!< SMIF Direct Write Control Register 1         */
    uint32_t RESERVED0[248];
    __IO uint32_t RACR0;             /*!< SMIF Indirect Access Control Register 0      */
    __IO uint32_t RACR1;             /*!< SMIF Indirect Access Control Register 1      */
    __IO uint32_t IOCR;              /*!< SMIF Indirect Access I/O Control Register    */
    __IO uint32_t OECR;              /*!< SMIF  Indirect Access Output Enable Register */
    uint32_t RESERVED1[12];
    __IO uint32_t INT;               /*!< SMIF Interrupt Control Register              */
    __IO uint32_t STAT;              /*!< SMIF Status Register                         */
    uint32_t RESERVED2[14];
    __IO uint32_t SWR;               /*!< SMIF Software Reset Register                 */
    __IO uint32_t ACKR;              /*!< SMIF Additional Clock Control Register       */
    __IO uint32_t CCOR;              /*!< SMIF Serial Clock, CS pin Direction Control Register*/
    __IO uint32_t STPR;              /*!< SMIF Forced Stop Control Register            */
    uint32_t RESERVED3[28];
    __IO uint32_t PBUF0;             /*!< SMIF  Indirect Access Primary Buffer Register 0*/
    __IO uint32_t PBUF1;             /*!< SMIF Indirect Access Primary Buffer Register 1*/
    __IO uint32_t PBUF2;             /*!< SMIF Indirect Access Primary Buffer Register 2*/
    __IO uint32_t PBUF3;             /*!< SMIF Indirect Access Primary Buffer Register 3*/
    __IO uint32_t PBUF4;             /*!< SMIF Indirect Access Primary Buffer Register 4*/
    __IO uint32_t PBUF5;             /*!< SMIF Indirect Access Primary Buffer Register 5*/
    __IO uint32_t PBUF6;             /*!< SMIF Indirect Access Primary Buffer Register 6*/
    __IO uint32_t PBUF7;             /*!< SMIF Indirect Access Primary Buffer Register 7*/
    uint32_t RESERVED4[56];
    __IO uint32_t SBUF00;            /*!< SMIF Indirect Access Secondary Buffer Register 00*/
    __IO uint32_t SBUF01;            /*!< SMIF Indirect Access Secondary Buffer Register 01*/
    __IO uint32_t SBUF02;            /*!< SMIF Indirect Access Secondary Buffer Register 02*/
    __IO uint32_t SBUF03;            /*!< SMIF Indirect Access Secondary Buffer Register 03*/
    __IO uint32_t SBUF04;            /*!< SMIF Indirect Access Secondary Buffer Register 04*/
    __IO uint32_t SBUF05;            /*!< SMIF Indirect Access Secondary Buffer Register 05*/
    __IO uint32_t SBUF06;            /*!< SMIF Indirect Access Secondary Buffer Register 06*/
    __IO uint32_t SBUF07;            /*!< SMIF Indirect Access Secondary Buffer Register 07*/
    __IO uint32_t SBUF08;            /*!< SMIF Indirect Access Secondary Buffer Register 08*/
    __IO uint32_t SBUF09;            /*!< SMIF Indirect Access Secondary Buffer Register 09*/
    __IO uint32_t SBUF10;            /*!< SMIF Indirect Access Secondary Buffer Register 10*/
    __IO uint32_t SBUF11;            /*!< SMIF Indirect Access Secondary Buffer Register 11*/
    __IO uint32_t SBUF12;            /*!< SMIF Indirect Access Secondary Buffer Register 12*/
    __IO uint32_t SBUF13;            /*!< SMIF Indirect Access Secondary Buffer Register 13*/
    __IO uint32_t SBUF14;            /*!< SMIF Indirect Access Secondary Buffer Register 14*/
    __IO uint32_t SBUF15;            /*!< SMIF Indirect Access Secondary Buffer Register 15*/
    __IO uint32_t SBUF16;            /*!< SMIF Indirect Access Secondary Buffer Register 16*/
    __IO uint32_t SBUF17;            /*!< SMIF Indirect Access Secondary Buffer Register 17*/
    __IO uint32_t SBUF18;            /*!< SMIF Indirect Access Secondary Buffer Register 18*/
    __IO uint32_t SBUF19;            /*!< SMIF Indirect Access Secondary Buffer Register 19*/
    __IO uint32_t SBUF20;            /*!< SMIF Indirect Access Secondary Buffer Register 20*/
    __IO uint32_t SBUF21;            /*!< SMIF Indirect Access Secondary Buffer Register 21*/
    __IO uint32_t SBUF22;            /*!< SMIF Indirect Access Secondary Buffer Register 22*/
    __IO uint32_t SBUF23;            /*!< SMIF Indirect Access Secondary Buffer Register 23*/
    __IO uint32_t SBUF24;            /*!< SMIF Indirect Access Secondary Buffer Register 24*/
    __IO uint32_t SBUF25;            /*!< SMIF Indirect Access Secondary Buffer Register 25*/
    __IO uint32_t SBUF26;            /*!< SMIF Indirect Access Secondary Buffer Register 26*/
    __IO uint32_t SBUF27;            /*!< SMIF Indirect Access Secondary Buffer Register 27*/
    __IO uint32_t SBUF28;            /*!< SMIF Indirect Access Secondary Buffer Register 28*/
    __IO uint32_t SBUF29;            /*!< SMIF Indirect Access Secondary Buffer Register 29*/
    __IO uint32_t SBUF30;            /*!< SMIF Indirect Access Secondary Buffer Register 30*/
    __IO uint32_t SBUF31;            /*!< SMIF Indirect Access Secondary Buffer Register 31*/
    __IO uint32_t SBUF32;            /*!< SMIF Indirect Access Secondary Buffer Register 32*/
    __IO uint32_t SBUF33;            /*!< SMIF Indirect Access Secondary Buffer Register 33*/
    __IO uint32_t SBUF34;            /*!< SMIF Indirect Access Secondary Buffer Register 34*/
    __IO uint32_t SBUF35;            /*!< SMIF Indirect Access Secondary Buffer Register 35*/
    __IO uint32_t SBUF36;            /*!< SMIF Indirect Access Secondary Buffer Register 36*/
    __IO uint32_t SBUF37;            /*!< SMIF Indirect Access Secondary Buffer Register 37*/
    __IO uint32_t SBUF38;            /*!< SMIF Indirect Access Secondary Buffer Register 38*/
    __IO uint32_t SBUF39;            /*!< SMIF Indirect Access Secondary Buffer Register 39*/
    __IO uint32_t SBUF40;            /*!< SMIF Indirect Access Secondary Buffer Register 40*/
    __IO uint32_t SBUF41;            /*!< SMIF Indirect Access Secondary Buffer Register 41*/
    __IO uint32_t SBUF42;            /*!< SMIF Indirect Access Secondary Buffer Register 42*/
    __IO uint32_t SBUF43;            /*!< SMIF Indirect Access Secondary Buffer Register 43*/
    __IO uint32_t SBUF44;            /*!< SMIF Indirect Access Secondary Buffer Register 44*/
    __IO uint32_t SBUF45;            /*!< SMIF Indirect Access Secondary Buffer Register 45*/
    __IO uint32_t SBUF46;            /*!< SMIF Indirect Access Secondary Buffer Register 46*/
    __IO uint32_t SBUF47;            /*!< SMIF Indirect Access Secondary Buffer Register 47*/
    __IO uint32_t SBUF48;            /*!< SMIF Indirect Access Secondary Buffer Register 48*/
    __IO uint32_t SBUF49;            /*!< SMIF Indirect Access Secondary Buffer Register 49*/
    __IO uint32_t SBUF50;            /*!< SMIF Indirect Access Secondary Buffer Register 50*/
    __IO uint32_t SBUF51;            /*!< SMIF Indirect Access Secondary Buffer Register 51*/
    __IO uint32_t SBUF52;            /*!< SMIF Indirect Access Secondary Buffer Register 52*/
    __IO uint32_t SBUF53;            /*!< SMIF Indirect Access Secondary Buffer Register 53*/
    __IO uint32_t SBUF54;            /*!< SMIF Indirect Access Secondary Buffer Register 54*/
    __IO uint32_t SBUF55;            /*!< SMIF Indirect Access Secondary Buffer Register 55*/
    __IO uint32_t SBUF56;            /*!< SMIF Indirect Access Secondary Buffer Register 56*/
    __IO uint32_t SBUF57;            /*!< SMIF Indirect Access Secondary Buffer Register 57*/
    __IO uint32_t SBUF58;            /*!< SMIF Indirect Access Secondary Buffer Register 58*/
    __IO uint32_t SBUF59;            /*!< SMIF Indirect Access Secondary Buffer Register 59*/
    __IO uint32_t SBUF60;            /*!< SMIF Indirect Access Secondary Buffer Register 60*/
    __IO uint32_t SBUF61;            /*!< SMIF Indirect Access Secondary Buffer Register 61*/
    __IO uint32_t SBUF62;            /*!< SMIF Indirect Access Secondary Buffer Register 62*/
    __IO uint32_t SBUF63;            /*!< SMIF Indirect Access Secondary Buffer Register 63*/
} TSB_SMI_TypeDef;

