ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4NR/device/TMPM4NR.h
/**
  * @brief I2S interface
  */
typedef struct {
    uint32_t RESERVED0;
    __IO uint32_t CSTART;            /*!< I2S Clock LRCK Generation Start Register     */
    __I  uint32_t CBUSY;             /*!< I2S Clock LRCK Generation Status Register    */
    __IO uint32_t CSTOP;             /*!< I2S Clock LRCK Generation Stop Register      */
    __IO uint32_t CAUDIOSET;         /*!< I2S Clock AUDIOSET Register                  */
    uint32_t RESERVED1[11];
    __I  uint32_t CREGBUSY;          /*!< I2S Clock REGBUSY Register                   */
    uint32_t RESERVED2[45];
    __IO uint32_t CMODESET;          /*!< I2S Clock Audio Data Format Setting Register */
    uint32_t RESERVED3[65];
    __IO uint32_t CMS_SEL;           /*!< I2S Clock Master/Slave Select Register       */
    __IO uint32_t CMCLK_IO_SEL;      /*!< I2S Clock MCLK pin input/output Selection Register*/
    uint32_t RESERVED4[3];
    __IO uint32_t CPHT_DIV;          /*!< I2S Clock Phi T0 Frequency Division Setting Register*/
    __IO uint32_t CPHT_DIVOUT_EN;    /*!< I2S Clock Phi T0 Divided Clock Output Enable Register*/
    uint32_t RESERVED5;
    __IO uint32_t CBCK_SRC_SEL;      /*!< I2S Clock BCK Source Clock Select Register   */
    __IO uint32_t CBCK_DIV;          /*!< I2S Clock BCK Frequency Division Setting Register*/
    __IO uint32_t CBCK_DIVOUT_EN;    /*!< I2S Clock BCK Output Enable Register         */
    uint32_t RESERVED6[118];
    __IO uint32_t ISTART;            /*!< I2S Receive Control Start Register           */
    __I  uint32_t IBUSY;             /*!< I2S Receive Operation Status Register        */
    __IO uint32_t ISTOP;             /*!< I2S Data Receive Stop Register               */
    __IO uint32_t IAUDIOSET;         /*!< I2S Receive AUDIOSET Register                */
    __I  uint32_t IINTSTAT;          /*!< I2S Receive Control Interrupt Status Register*/
    __IO uint32_t IINTMASK;          /*!< I2S Receive Control Interrupt Mask Register  */
    __IO uint32_t IINTCLR;           /*!< I2S Receive Control Interrupt Clear Register */
    uint32_t RESERVED7;
    __IO uint32_t IMUTE;             /*!< I2S Receive Mute Setting Register            */
    __I  uint32_t IEPTR;             /*!< I2S Receive Control Error Occurrence Address Storage Register*/
    uint32_t RESERVED8[5];
    __I  uint32_t IREGBUSY;          /*!< I2S Receive REGBUSY register                 */
    uint32_t RESERVED9[3];
    __IO uint32_t ITHRESHOLD;        /*!< I2S Receive Threshold Setting Register       */
    __I  uint32_t IFIFO_STS;         /*!< I2S Receive FIFO Status Register             */
    uint32_t RESERVED10[40];
    __IO uint32_t IMODESET;          /*!< I2S Receive Audio Data Format Setting Register*/
    uint32_t RESERVED11;
    __I  uint32_t ILMEM00;           /*!< I2S Receive Data Storage Register 00         */
    __I  uint32_t ILMEM01;           /*!< I2S Receive Data Storage Register 01         */
    __I  uint32_t ILMEM02;           /*!< I2S Receive Data Storage Register 02         */
    __I  uint32_t ILMEM03;           /*!< I2S Receive Data Storage Register 03         */
    __I  uint32_t ILMEM04;           /*!< I2S Receive Data Storage Register 04         */
    __I  uint32_t ILMEM05;           /*!< I2S Receive Data Storage Register 05         */
    __I  uint32_t ILMEM06;           /*!< I2S Receive Data Storage Register 06         */
    __I  uint32_t ILMEM07;           /*!< I2S Receive Data Storage Register 07         */
    __I  uint32_t ILMEM08;           /*!< I2S Receive Data Storage Register 08         */
    __I  uint32_t ILMEM09;           /*!< I2S Receive Data Storage Register 09         */
    __I  uint32_t ILMEM10;           /*!< I2S Receive Data Storage Register 10         */
    __I  uint32_t ILMEM11;           /*!< I2S Receive Data Storage Register 11         */
    __I  uint32_t ILMEM12;           /*!< I2S Receive Data Storage Register 12         */
    __I  uint32_t ILMEM13;           /*!< I2S Receive Data Storage Register 13         */
    __I  uint32_t ILMEM14;           /*!< I2S Receive Data Storage Register 14         */
    __I  uint32_t ILMEM15;           /*!< I2S Receive Data Storage Register 15         */
    __I  uint32_t ILMEM16;           /*!< I2S Receive Data Storage Register 16         */
    __I  uint32_t ILMEM17;           /*!< I2S Receive Data Storage Register 17         */
    __I  uint32_t ILMEM18;           /*!< I2S Receive Data Storage Register 18         */
    __I  uint32_t ILMEM19;           /*!< I2S Receive Data Storage Register 19         */
    __I  uint32_t ILMEM20;           /*!< I2S Receive Data Storage Register 20         */
    __I  uint32_t ILMEM21;           /*!< I2S Receive Data Storage Register 21         */
    __I  uint32_t ILMEM22;           /*!< I2S Receive Data Storage Register 22         */
    __I  uint32_t ILMEM23;           /*!< I2S Receive Data Storage Register 23         */
    __I  uint32_t ILMEM24;           /*!< I2S Receive Data Storage Register 24         */
    __I  uint32_t ILMEM25;           /*!< I2S Receive Data Storage Register 25         */
    __I  uint32_t ILMEM26;           /*!< I2S Receive Data Storage Register 26         */
    __I  uint32_t ILMEM27;           /*!< I2S Receive Data Storage Register 27         */
    __I  uint32_t ILMEM28;           /*!< I2S Receive Data Storage Register 28         */
    __I  uint32_t ILMEM29;           /*!< I2S Receive Data Storage Register 29         */
    __I  uint32_t ILMEM30;           /*!< I2S Receive Data Storage Register 30         */
    __I  uint32_t ILMEM31;           /*!< I2S Receive Data Storage Register 31         */
    __I  uint32_t ILMEM32;           /*!< I2S Receive Data Storage Register 32         */
    __I  uint32_t ILMEM33;           /*!< I2S Receive Data Storage Register 33         */
    __I  uint32_t ILMEM34;           /*!< I2S Receive Data Storage Register 34         */
    __I  uint32_t ILMEM35;           /*!< I2S Receive Data Storage Register 35         */
    __I  uint32_t ILMEM36;           /*!< I2S Receive Data Storage Register 36         */
    __I  uint32_t ILMEM37;           /*!< I2S Receive Data Storage Register 37         */
    __I  uint32_t ILMEM38;           /*!< I2S Receive Data Storage Register 38         */
    __I  uint32_t ILMEM39;           /*!< I2S Receive Data Storage Register 39         */
    __I  uint32_t ILMEM40;           /*!< I2S Receive Data Storage Register 40         */
    __I  uint32_t ILMEM41;           /*!< I2S Receive Data Storage Register 41         */
    __I  uint32_t ILMEM42;           /*!< I2S Receive Data Storage Register 42         */
    __I  uint32_t ILMEM43;           /*!< I2S Receive Data Storage Register 43         */
    __I  uint32_t ILMEM44;           /*!< I2S Receive Data Storage Register 44         */
    __I  uint32_t ILMEM45;           /*!< I2S Receive Data Storage Register 45         */
    __I  uint32_t ILMEM46;           /*!< I2S Receive Data Storage Register 46         */
    __I  uint32_t ILMEM47;           /*!< I2S Receive Data Storage Register 47         */
    __I  uint32_t ILMEM48;           /*!< I2S Receive Data Storage Register 48         */
    __I  uint32_t ILMEM49;           /*!< I2S Receive Data Storage Register 49         */
    __I  uint32_t ILMEM50;           /*!< I2S Receive Data Storage Register 50         */
    __I  uint32_t ILMEM51;           /*!< I2S Receive Data Storage Register 51         */
    __I  uint32_t ILMEM52;           /*!< I2S Receive Data Storage Register 52         */
    __I  uint32_t ILMEM53;           /*!< I2S Receive Data Storage Register 53         */
    __I  uint32_t ILMEM54;           /*!< I2S Receive Data Storage Register 54         */
    __I  uint32_t ILMEM55;           /*!< I2S Receive Data Storage Register 55         */
    __I  uint32_t ILMEM56;           /*!< I2S Receive Data Storage Register 56         */
    __I  uint32_t ILMEM57;           /*!< I2S Receive Data Storage Register 57         */
    __I  uint32_t ILMEM58;           /*!< I2S Receive Data Storage Register 58         */
    __I  uint32_t ILMEM59;           /*!< I2S Receive Data Storage Register 59         */
    __I  uint32_t ILMEM60;           /*!< I2S Receive Data Storage Register 60         */
    __I  uint32_t ILMEM61;           /*!< I2S Receive Data Storage Register 61         */
    __I  uint32_t ILMEM62;           /*!< I2S Receive Data Storage Register 62         */
    __I  uint32_t ILMEM63;           /*!< I2S Receive Data Storage Register 63         */
    uint32_t RESERVED12;
    __IO uint32_t OSTART;            /*!< I2S Transmit Control Start Register          */
    __I  uint32_t OBUSY;             /*!< I2S Transmit Operation Status Register       */
    __IO uint32_t OSTOP;             /*!< I2S Data Transmit Stop Register              */
    __IO uint32_t OAUDIOSET;         /*!< I2S Transmit AUDIOSET Register               */
    __I  uint32_t OINTSTAT;          /*!< I2S Transmit Control Interrupt Status Register*/
    __IO uint32_t OINTMASK;          /*!< I2S Transmit Control Interrupt Mask Register */
    __IO uint32_t OINTCLR;           /*!< I2S Transmit Control Interrupt Clear Register*/
    uint32_t RESERVED13;
    __IO uint32_t OMUTE;             /*!< I2S Transmit Mute Setting Register           */
    __I  uint32_t OEPTR;             /*!< I2S Transmit Control Error Occurrence Address Storage Register*/
    uint32_t RESERVED14;
    __IO uint32_t OTX_SSIZE;         /*!< I2S TX_SSIZE Register                        */
    uint32_t RESERVED15[3];
    __I  uint32_t OREGBUSY;          /*!< I2S Transmit  REGBUSY Register               */
    uint32_t RESERVED16[3];
    __IO uint32_t OTHRESHOLD;        /*!< I2S Transmit Threshold Setting Register      */
    __I  uint32_t OFIFO_STS;         /*!< I2S Transmit FIFO Status Register            */
    uint32_t RESERVED17[40];
    __IO uint32_t OMODESET;          /*!< I2S Transmit Audio Data Format Setting Register*/
    uint32_t RESERVED18;
    __O  uint32_t OLMEM00;           /*!< I2S Transmit Data Storage Register 00        */
    __O  uint32_t OLMEM01;           /*!< I2S Transmit Data Storage Register 01        */
    __O  uint32_t OLMEM02;           /*!< I2S Transmit Data Storage Register 02        */
    __O  uint32_t OLMEM03;           /*!< I2S Transmit Data Storage Register 03        */
    __O  uint32_t OLMEM04;           /*!< I2S Transmit Data Storage Register 04        */
    __O  uint32_t OLMEM05;           /*!< I2S Transmit Data Storage Register 05        */
    __O  uint32_t OLMEM06;           /*!< I2S Transmit Data Storage Register 06        */
    __O  uint32_t OLMEM07;           /*!< I2S Transmit Data Storage Register 07        */
    __O  uint32_t OLMEM08;           /*!< I2S Transmit Data Storage Register 08        */
    __O  uint32_t OLMEM09;           /*!< I2S Transmit Data Storage Register 09        */
    __O  uint32_t OLMEM10;           /*!< I2S Transmit Data Storage Register 10        */
    __O  uint32_t OLMEM11;           /*!< I2S Transmit Data Storage Register 11        */
    __O  uint32_t OLMEM12;           /*!< I2S Transmit Data Storage Register 12        */
    __O  uint32_t OLMEM13;           /*!< I2S Transmit Data Storage Register 13        */
    __O  uint32_t OLMEM14;           /*!< I2S Transmit Data Storage Register 14        */
    __O  uint32_t OLMEM15;           /*!< I2S Transmit Data Storage Register 15        */
    __O  uint32_t OLMEM16;           /*!< I2S Transmit Data Storage Register 16        */
    __O  uint32_t OLMEM17;           /*!< I2S Transmit Data Storage Register 17        */
    __O  uint32_t OLMEM18;           /*!< I2S Transmit Data Storage Register 18        */
    __O  uint32_t OLMEM19;           /*!< I2S Transmit Data Storage Register 19        */
    __O  uint32_t OLMEM20;           /*!< I2S Transmit Data Storage Register 20        */
    __O  uint32_t OLMEM21;           /*!< I2S Transmit Data Storage Register 21        */
    __O  uint32_t OLMEM22;           /*!< I2S Transmit Data Storage Register 22        */
    __O  uint32_t OLMEM23;           /*!< I2S Transmit Data Storage Register 23        */
    __O  uint32_t OLMEM24;           /*!< I2S Transmit Data Storage Register 24        */
    __O  uint32_t OLMEM25;           /*!< I2S Transmit Data Storage Register 25        */
    __O  uint32_t OLMEM26;           /*!< I2S Transmit Data Storage Register 26        */
    __O  uint32_t OLMEM27;           /*!< I2S Transmit Data Storage Register 27        */
    __O  uint32_t OLMEM28;           /*!< I2S Transmit Data Storage Register 28        */
    __O  uint32_t OLMEM29;           /*!< I2S Transmit Data Storage Register 29        */
    __O  uint32_t OLMEM30;           /*!< I2S Transmit Data Storage Register 30        */
    __O  uint32_t OLMEM31;           /*!< I2S Transmit Data Storage Register 31        */
    __O  uint32_t OLMEM32;           /*!< I2S Transmit Data Storage Register 32        */
    __O  uint32_t OLMEM33;           /*!< I2S Transmit Data Storage Register 33        */
    __O  uint32_t OLMEM34;           /*!< I2S Transmit Data Storage Register 34        */
    __O  uint32_t OLMEM35;           /*!< I2S Transmit Data Storage Register 35        */
    __O  uint32_t OLMEM36;           /*!< I2S Transmit Data Storage Register 36        */
    __O  uint32_t OLMEM37;           /*!< I2S Transmit Data Storage Register 37        */
    __O  uint32_t OLMEM38;           /*!< I2S Transmit Data Storage Register 38        */
    __O  uint32_t OLMEM39;           /*!< I2S Transmit Data Storage Register 39        */
    __O  uint32_t OLMEM40;           /*!< I2S Transmit Data Storage Register 40        */
    __O  uint32_t OLMEM41;           /*!< I2S Transmit Data Storage Register 41        */
    __O  uint32_t OLMEM42;           /*!< I2S Transmit Data Storage Register 42        */
    __O  uint32_t OLMEM43;           /*!< I2S Transmit Data Storage Register 43        */
    __O  uint32_t OLMEM44;           /*!< I2S Transmit Data Storage Register 44        */
    __O  uint32_t OLMEM45;           /*!< I2S Transmit Data Storage Register 45        */
    __O  uint32_t OLMEM46;           /*!< I2S Transmit Data Storage Register 46        */
    __O  uint32_t OLMEM47;           /*!< I2S Transmit Data Storage Register 47        */
    __O  uint32_t OLMEM48;           /*!< I2S Transmit Data Storage Register 48        */
    __O  uint32_t OLMEM49;           /*!< I2S Transmit Data Storage Register 49        */
    __O  uint32_t OLMEM50;           /*!< I2S Transmit Data Storage Register 50        */
    __O  uint32_t OLMEM51;           /*!< I2S Transmit Data Storage Register 51        */
    __O  uint32_t OLMEM52;           /*!< I2S Transmit Data Storage Register 52        */
    __O  uint32_t OLMEM53;           /*!< I2S Transmit Data Storage Register 53        */
    __O  uint32_t OLMEM54;           /*!< I2S Transmit Data Storage Register 54        */
    __O  uint32_t OLMEM55;           /*!< I2S Transmit Data Storage Register 55        */
    __O  uint32_t OLMEM56;           /*!< I2S Transmit Data Storage Register 56        */
    __O  uint32_t OLMEM57;           /*!< I2S Transmit Data Storage Register 57        */
    __O  uint32_t OLMEM58;           /*!< I2S Transmit Data Storage Register 58        */
    __O  uint32_t OLMEM59;           /*!< I2S Transmit Data Storage Register 59        */
    __O  uint32_t OLMEM60;           /*!< I2S Transmit Data Storage Register 60        */
    __O  uint32_t OLMEM61;           /*!< I2S Transmit Data Storage Register 61        */
    __O  uint32_t OLMEM62;           /*!< I2S Transmit Data Storage Register 62        */
    __O  uint32_t OLMEM63;           /*!< I2S Transmit Data Storage Register 63        */
} TSB_I2S_TypeDef;

/**
  * @brief I2C
  */
typedef struct {
    __IO uint32_t CR1;               /*!< I2C Control Register 1                       */
    __IO uint32_t DBR;               /*!< I2C Data Buffer Register                     */
    __IO uint32_t AR;                /*!< I2C Bus address Register                     */
    union {
        __O  uint32_t CR2;               /*!< I2C Control Register 2                       */
        __I  uint32_t SR;                /*!< I2C Status Register                          */
    };
    __IO uint32_t PRS;               /*!< I2C Prescaler clcok setting Register         */
    __IO uint32_t IE;                /*!< I2C Interrupt Enable Register                */
    __IO uint32_t ST;                /*!< I2C Interruption Status Register             */
    __IO uint32_t OP;                /*!< I2C Expanded function setting Register       */
    __I  uint32_t PM;                /*!< I2C Bus pin Monitor Register                 */
    __IO uint32_t AR2;               /*!< I2C 2nd address Register                     */
} TSB_I2C_TypeDef;

/**
  * @brief EI2C
  */
typedef struct {
    __IO uint32_t ARST;              /*!< I2C Reset Register                           */
    __IO uint32_t AEN;               /*!< I2C Bus Enable Register                      */
    __IO uint32_t ACR0;              /*!< I2C Control Register 0                       */
    __IO uint32_t ACR1;              /*!< I2C Control Register 1                       */
    __IO uint32_t ADBRT;             /*!< I2C Transmit Data Buffer Register            */
    __I  uint32_t ADBRR;             /*!< I2C Receive Data Buffer Register             */
    __I  uint32_t ASR0;              /*!< I2C Status Register 0                        */
    __IO uint32_t ASR1;              /*!< I2C Status Register 1                        */
    __IO uint32_t APRS;              /*!< I2C Prescaler Clock Setting Register         */
    __IO uint32_t ASCL;              /*!< I2C SCL Wdth Setting Register                */
    __IO uint32_t AAR1;              /*!< I2C 1st Slave Address Register               */
    __IO uint32_t AAR2;              /*!< I2C 2nd Slave Address Register               */
    __IO uint32_t AIE;               /*!< I2C Interrupt DMA Setting Register           */
    __I  uint32_t APM;               /*!< I2C Bus Terminal Monitor Setting Register    */
} TSB_EI2C_TypeDef;

