ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4NR/device/TMPM4NR.h
#define TSB_CANBMB10_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB10->ID,29)))
#define TSB_CANBMB10_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB10->ID,30)))
#define TSB_CANBMB10_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB10->ID,31)))
#define TSB_CANBMB10_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB10->TSVMCF,4)))

#define TSB_CANBMB11_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB11->ID,29)))
#define TSB_CANBMB11_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB11->ID,30)))
#define TSB_CANBMB11_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB11->ID,31)))
#define TSB_CANBMB11_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB11->TSVMCF,4)))

#define TSB_CANBMB12_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB12->ID,29)))
#define TSB_CANBMB12_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB12->ID,30)))
#define TSB_CANBMB12_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB12->ID,31)))
#define TSB_CANBMB12_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB12->TSVMCF,4)))

#define TSB_CANBMB13_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB13->ID,29)))
#define TSB_CANBMB13_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB13->ID,30)))
#define TSB_CANBMB13_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB13->ID,31)))
#define TSB_CANBMB13_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB13->TSVMCF,4)))

#define TSB_CANBMB14_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB14->ID,29)))
#define TSB_CANBMB14_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB14->ID,30)))
#define TSB_CANBMB14_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB14->ID,31)))
#define TSB_CANBMB14_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB14->TSVMCF,4)))

#define TSB_CANBMB15_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB15->ID,29)))
#define TSB_CANBMB15_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB15->ID,30)))
#define TSB_CANBMB15_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB15->ID,31)))
#define TSB_CANBMB15_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB15->TSVMCF,4)))

#define TSB_CANBMB16_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB16->ID,29)))
#define TSB_CANBMB16_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB16->ID,30)))
#define TSB_CANBMB16_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB16->ID,31)))
#define TSB_CANBMB16_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB16->TSVMCF,4)))

#define TSB_CANBMB17_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB17->ID,29)))
#define TSB_CANBMB17_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB17->ID,30)))
#define TSB_CANBMB17_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB17->ID,31)))
#define TSB_CANBMB17_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB17->TSVMCF,4)))

#define TSB_CANBMB18_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB18->ID,29)))
#define TSB_CANBMB18_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB18->ID,30)))
#define TSB_CANBMB18_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB18->ID,31)))
#define TSB_CANBMB18_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB18->TSVMCF,4)))

#define TSB_CANBMB19_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB19->ID,29)))
#define TSB_CANBMB19_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB19->ID,30)))
#define TSB_CANBMB19_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB19->ID,31)))
#define TSB_CANBMB19_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB19->TSVMCF,4)))

#define TSB_CANBMB20_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB20->ID,29)))
#define TSB_CANBMB20_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB20->ID,30)))
#define TSB_CANBMB20_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB20->ID,31)))
#define TSB_CANBMB20_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB20->TSVMCF,4)))

#define TSB_CANBMB21_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB21->ID,29)))
#define TSB_CANBMB21_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB21->ID,30)))
#define TSB_CANBMB21_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB21->ID,31)))
#define TSB_CANBMB21_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB21->TSVMCF,4)))

#define TSB_CANBMB22_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB22->ID,29)))
#define TSB_CANBMB22_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB22->ID,30)))
#define TSB_CANBMB22_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB22->ID,31)))
#define TSB_CANBMB22_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB22->TSVMCF,4)))

#define TSB_CANBMB23_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB23->ID,29)))
#define TSB_CANBMB23_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB23->ID,30)))
#define TSB_CANBMB23_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB23->ID,31)))
#define TSB_CANBMB23_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB23->TSVMCF,4)))

#define TSB_CANBMB24_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB24->ID,29)))
#define TSB_CANBMB24_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB24->ID,30)))
#define TSB_CANBMB24_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB24->ID,31)))
#define TSB_CANBMB24_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB24->TSVMCF,4)))

#define TSB_CANBMB25_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB25->ID,29)))
#define TSB_CANBMB25_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB25->ID,30)))
#define TSB_CANBMB25_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB25->ID,31)))
#define TSB_CANBMB25_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB25->TSVMCF,4)))

#define TSB_CANBMB26_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB26->ID,29)))
#define TSB_CANBMB26_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB26->ID,30)))
#define TSB_CANBMB26_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB26->ID,31)))
#define TSB_CANBMB26_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB26->TSVMCF,4)))

#define TSB_CANBMB27_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB27->ID,29)))
#define TSB_CANBMB27_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB27->ID,30)))
#define TSB_CANBMB27_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB27->ID,31)))
#define TSB_CANBMB27_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB27->TSVMCF,4)))

#define TSB_CANBMB28_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB28->ID,29)))
#define TSB_CANBMB28_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB28->ID,30)))
#define TSB_CANBMB28_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB28->ID,31)))
#define TSB_CANBMB28_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB28->TSVMCF,4)))

#define TSB_CANBMB29_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB29->ID,29)))
#define TSB_CANBMB29_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB29->ID,30)))
#define TSB_CANBMB29_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB29->ID,31)))
#define TSB_CANBMB29_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB29->TSVMCF,4)))

#define TSB_CANBMB30_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB30->ID,29)))
#define TSB_CANBMB30_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB30->ID,30)))
#define TSB_CANBMB30_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB30->ID,31)))
#define TSB_CANBMB30_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB30->TSVMCF,4)))

#define TSB_CANBMB31_ID_RFH                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB31->ID,29)))
#define TSB_CANBMB31_ID_GAME_LAME                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB31->ID,30)))
#define TSB_CANBMB31_ID_IDE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB31->ID,31)))
#define TSB_CANBMB31_TSVMCF_RTR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANBMB31->TSVMCF,4)))


