ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4NR/device/TMPM4NR.h
#define TSB_CANA_RML_RML12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,12)))
#define TSB_CANA_RML_RML13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,13)))
#define TSB_CANA_RML_RML14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,14)))
#define TSB_CANA_RML_RML15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,15)))
#define TSB_CANA_RML_RML16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,16)))
#define TSB_CANA_RML_RML17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,17)))
#define TSB_CANA_RML_RML18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,18)))
#define TSB_CANA_RML_RML19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,19)))
#define TSB_CANA_RML_RML20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,20)))
#define TSB_CANA_RML_RML21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,21)))
#define TSB_CANA_RML_RML22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,22)))
#define TSB_CANA_RML_RML23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,23)))
#define TSB_CANA_RML_RML24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,24)))
#define TSB_CANA_RML_RML25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,25)))
#define TSB_CANA_RML_RML26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,26)))
#define TSB_CANA_RML_RML27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,27)))
#define TSB_CANA_RML_RML28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,28)))
#define TSB_CANA_RML_RML29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,29)))
#define TSB_CANA_RML_RML30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,30)))
#define TSB_CANA_RML_RML31                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,31)))
#define TSB_CANA_LAM_LAMI                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->LAM,31)))
#define TSB_CANA_GAM_GAMI                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GAM,31)))
#define TSB_CANA_MCR_SRES                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,0)))
#define TSB_CANA_MCR_TSCC                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,1)))
#define TSB_CANA_MCR_MTOS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,3)))
#define TSB_CANA_MCR_WUBA                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,4)))
#define TSB_CANA_MCR_SMR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,6)))
#define TSB_CANA_MCR_CCR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,7)))
#define TSB_CANA_MCR_TSTERR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,8)))
#define TSB_CANA_MCR_TSTLB                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,9)))
#define TSB_CANA_MCR_SUR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MCR,11)))
#define TSB_CANA_GSR_EW                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,0)))
#define TSB_CANA_GSR_EP                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,1)))
#define TSB_CANA_GSR_BO                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,2)))
#define TSB_CANA_GSR_TSO                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,3)))
#define TSB_CANA_GSR_SMA                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,6)))
#define TSB_CANA_GSR_CCE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,7)))
#define TSB_CANA_GSR_SUA                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,8)))
#define TSB_CANA_GSR_TM                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,10)))
#define TSB_CANA_GSR_RM                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->GSR,11)))
#define TSB_CANA_BCR2_SAM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->BCR2,7)))
#define TSB_CANA_GIF_WLIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,0)))
#define TSB_CANA_GIF_EPIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,1)))
#define TSB_CANA_GIF_BOIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,2)))
#define TSB_CANA_GIF_TSOIF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,3)))
#define TSB_CANA_GIF_TRMABF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,4)))
#define TSB_CANA_GIF_RMLIF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,5)))
#define TSB_CANA_GIF_WUIF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,6)))
#define TSB_CANA_GIF_RFPF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIF,7)))
#define TSB_CANA_GIM_WLIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,0)))
#define TSB_CANA_GIM_EPIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,1)))
#define TSB_CANA_GIM_BOIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,2)))
#define TSB_CANA_GIM_TSOIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,3)))
#define TSB_CANA_GIM_TRMABF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,4)))
#define TSB_CANA_GIM_RMLIM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,5)))
#define TSB_CANA_GIM_WUIM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,6)))
#define TSB_CANA_GIM_RFPM                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->GIM,7)))
#define TSB_CANA_MBTIF_MBTIF0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,0)))
#define TSB_CANA_MBTIF_MBTIF1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,1)))
#define TSB_CANA_MBTIF_MBTIF2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,2)))
#define TSB_CANA_MBTIF_MBTIF3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,3)))
#define TSB_CANA_MBTIF_MBTIF4                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,4)))
#define TSB_CANA_MBTIF_MBTIF5                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,5)))
#define TSB_CANA_MBTIF_MBTIF6                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,6)))
#define TSB_CANA_MBTIF_MBTIF7                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,7)))
#define TSB_CANA_MBTIF_MBTIF8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,8)))
#define TSB_CANA_MBTIF_MBTIF9                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,9)))
#define TSB_CANA_MBTIF_MBTIF10                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,10)))
#define TSB_CANA_MBTIF_MBTIF11                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,11)))
#define TSB_CANA_MBTIF_MBTIF12                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,12)))
#define TSB_CANA_MBTIF_MBTIF13                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,13)))
#define TSB_CANA_MBTIF_MBTIF14                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,14)))
#define TSB_CANA_MBTIF_MBTIF15                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,15)))
#define TSB_CANA_MBTIF_MBTIF16                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,16)))
#define TSB_CANA_MBTIF_MBTIF17                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,17)))
#define TSB_CANA_MBTIF_MBTIF18                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,18)))
#define TSB_CANA_MBTIF_MBTIF19                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,19)))
#define TSB_CANA_MBTIF_MBTIF20                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,20)))
#define TSB_CANA_MBTIF_MBTIF21                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,21)))
#define TSB_CANA_MBTIF_MBTIF22                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,22)))
#define TSB_CANA_MBTIF_MBTIF23                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,23)))
#define TSB_CANA_MBTIF_MBTIF24                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,24)))
#define TSB_CANA_MBTIF_MBTIF25                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,25)))
#define TSB_CANA_MBTIF_MBTIF26                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,26)))
#define TSB_CANA_MBTIF_MBTIF27                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,27)))
#define TSB_CANA_MBTIF_MBTIF28                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,28)))
#define TSB_CANA_MBTIF_MBTIF29                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,29)))
#define TSB_CANA_MBTIF_MBTIF30                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBTIF,30)))
#define TSB_CANA_MBRIF_MBRIF0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,0)))
#define TSB_CANA_MBRIF_MBRIF1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,1)))
#define TSB_CANA_MBRIF_MBRIF2                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,2)))
#define TSB_CANA_MBRIF_MBRIF3                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,3)))
#define TSB_CANA_MBRIF_MBRIF4                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,4)))
#define TSB_CANA_MBRIF_MBRIF5                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,5)))
#define TSB_CANA_MBRIF_MBRIF6                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,6)))
#define TSB_CANA_MBRIF_MBRIF7                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,7)))
#define TSB_CANA_MBRIF_MBRIF8                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,8)))
#define TSB_CANA_MBRIF_MBRIF9                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,9)))
#define TSB_CANA_MBRIF_MBRIF10                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,10)))
#define TSB_CANA_MBRIF_MBRIF11                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,11)))
#define TSB_CANA_MBRIF_MBRIF12                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,12)))
#define TSB_CANA_MBRIF_MBRIF13                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,13)))
#define TSB_CANA_MBRIF_MBRIF14                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,14)))
#define TSB_CANA_MBRIF_MBRIF15                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,15)))
#define TSB_CANA_MBRIF_MBRIF16                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,16)))
#define TSB_CANA_MBRIF_MBRIF17                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,17)))
#define TSB_CANA_MBRIF_MBRIF18                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,18)))
#define TSB_CANA_MBRIF_MBRIF19                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,19)))
#define TSB_CANA_MBRIF_MBRIF20                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,20)))
#define TSB_CANA_MBRIF_MBRIF21                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,21)))
#define TSB_CANA_MBRIF_MBRIF22                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,22)))
#define TSB_CANA_MBRIF_MBRIF23                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,23)))
#define TSB_CANA_MBRIF_MBRIF24                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,24)))
#define TSB_CANA_MBRIF_MBRIF25                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,25)))
#define TSB_CANA_MBRIF_MBRIF26                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,26)))
#define TSB_CANA_MBRIF_MBRIF27                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,27)))
#define TSB_CANA_MBRIF_MBRIF28                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,28)))
#define TSB_CANA_MBRIF_MBRIF29                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,29)))
#define TSB_CANA_MBRIF_MBRIF30                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,30)))
#define TSB_CANA_MBRIF_MBRIF31                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBRIF,31)))
#define TSB_CANA_MBIM_MBIM0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,0)))
#define TSB_CANA_MBIM_MBIM1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,1)))
#define TSB_CANA_MBIM_MBIM2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,2)))
#define TSB_CANA_MBIM_MBIM3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,3)))
#define TSB_CANA_MBIM_MBIM4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,4)))
#define TSB_CANA_MBIM_MBIM5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,5)))
#define TSB_CANA_MBIM_MBIM6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,6)))
#define TSB_CANA_MBIM_MBIM7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,7)))
#define TSB_CANA_MBIM_MBIM8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,8)))
#define TSB_CANA_MBIM_MBIM9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,9)))
#define TSB_CANA_MBIM_MBIM10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,10)))
#define TSB_CANA_MBIM_MBIM11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,11)))
#define TSB_CANA_MBIM_MBIM12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,12)))
#define TSB_CANA_MBIM_MBIM13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,13)))
#define TSB_CANA_MBIM_MBIM14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,14)))
#define TSB_CANA_MBIM_MBIM15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,15)))
#define TSB_CANA_MBIM_MBIM16                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,16)))
#define TSB_CANA_MBIM_MBIM17                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,17)))
#define TSB_CANA_MBIM_MBIM18                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,18)))
#define TSB_CANA_MBIM_MBIM19                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,19)))
#define TSB_CANA_MBIM_MBIM20                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,20)))
#define TSB_CANA_MBIM_MBIM21                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,21)))
#define TSB_CANA_MBIM_MBIM22                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,22)))
#define TSB_CANA_MBIM_MBIM23                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,23)))
#define TSB_CANA_MBIM_MBIM24                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,24)))
#define TSB_CANA_MBIM_MBIM25                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,25)))
#define TSB_CANA_MBIM_MBIM26                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,26)))
#define TSB_CANA_MBIM_MBIM27                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,27)))
#define TSB_CANA_MBIM_MBIM28                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,28)))
#define TSB_CANA_MBIM_MBIM29                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,29)))
#define TSB_CANA_MBIM_MBIM30                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,30)))
#define TSB_CANA_MBIM_MBIM31                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MBIM,31)))
#define TSB_CANA_CDR_CDR0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,0)))
#define TSB_CANA_CDR_CDR1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,1)))
#define TSB_CANA_CDR_CDR2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,2)))
#define TSB_CANA_CDR_CDR3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,3)))
#define TSB_CANA_CDR_CDR4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,4)))
#define TSB_CANA_CDR_CDR5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,5)))
#define TSB_CANA_CDR_CDR6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,6)))
#define TSB_CANA_CDR_CDR7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,7)))
#define TSB_CANA_CDR_CDR8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,8)))
#define TSB_CANA_CDR_CDR9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,9)))
#define TSB_CANA_CDR_CDR10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,10)))
#define TSB_CANA_CDR_CDR11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,11)))
#define TSB_CANA_CDR_CDR12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,12)))
#define TSB_CANA_CDR_CDR13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,13)))
#define TSB_CANA_CDR_CDR14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,14)))
#define TSB_CANA_CDR_CDR15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,15)))
#define TSB_CANA_CDR_CDR16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,16)))
#define TSB_CANA_CDR_CDR17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,17)))
#define TSB_CANA_CDR_CDR18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,18)))
#define TSB_CANA_CDR_CDR19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,19)))
#define TSB_CANA_CDR_CDR20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,20)))
#define TSB_CANA_CDR_CDR21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,21)))
#define TSB_CANA_CDR_CDR22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,22)))
#define TSB_CANA_CDR_CDR23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,23)))
#define TSB_CANA_CDR_CDR24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,24)))
#define TSB_CANA_CDR_CDR25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,25)))
#define TSB_CANA_CDR_CDR26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,26)))
#define TSB_CANA_CDR_CDR27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,27)))
#define TSB_CANA_CDR_CDR28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,28)))
#define TSB_CANA_CDR_CDR29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,29)))
#define TSB_CANA_CDR_CDR30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->CDR,30)))
#define TSB_CANA_RFP_RFP0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,0)))
#define TSB_CANA_RFP_RFP1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,1)))
#define TSB_CANA_RFP_RFP2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,2)))
#define TSB_CANA_RFP_RFP3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,3)))
#define TSB_CANA_RFP_RFP4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,4)))
#define TSB_CANA_RFP_RFP5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,5)))
#define TSB_CANA_RFP_RFP6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,6)))
#define TSB_CANA_RFP_RFP7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,7)))
#define TSB_CANA_RFP_RFP8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,8)))
#define TSB_CANA_RFP_RFP9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,9)))
#define TSB_CANA_RFP_RFP10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,10)))
#define TSB_CANA_RFP_RFP11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,11)))
#define TSB_CANA_RFP_RFP12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,12)))
#define TSB_CANA_RFP_RFP13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,13)))
#define TSB_CANA_RFP_RFP14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,14)))
#define TSB_CANA_RFP_RFP15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,15)))
#define TSB_CANA_RFP_RFP16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,16)))
#define TSB_CANA_RFP_RFP17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,17)))
#define TSB_CANA_RFP_RFP18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,18)))
#define TSB_CANA_RFP_RFP19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,19)))
#define TSB_CANA_RFP_RFP20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,20)))
#define TSB_CANA_RFP_RFP21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,21)))
#define TSB_CANA_RFP_RFP22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,22)))
#define TSB_CANA_RFP_RFP23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,23)))
#define TSB_CANA_RFP_RFP24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,24)))
#define TSB_CANA_RFP_RFP25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,25)))
#define TSB_CANA_RFP_RFP26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,26)))
#define TSB_CANA_RFP_RFP27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,27)))
#define TSB_CANA_RFP_RFP28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,28)))
#define TSB_CANA_RFP_RFP29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,29)))
#define TSB_CANA_RFP_RFP30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,30)))
#define TSB_CANA_RFP_RFP31                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RFP,31)))

