ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4NR/device/TMPM4NR.h
/* Ether Mac */
#define TSB_EMA_TMAC_CONFIGURATION_RE             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,2)))
#define TSB_EMA_TMAC_CONFIGURATION_TE             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,3)))
#define TSB_EMA_TMAC_CONFIGURATION_DC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,4)))
#define TSB_EMA_TMAC_CONFIGURATION_ACS            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,7)))
#define TSB_EMA_TMAC_CONFIGURATION_DR             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,9)))
#define TSB_EMA_TMAC_CONFIGURATION_IPC            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,10)))
#define TSB_EMA_TMAC_CONFIGURATION_DM             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,11)))
#define TSB_EMA_TMAC_CONFIGURATION_LM             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,12)))
#define TSB_EMA_TMAC_CONFIGURATION_DO             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,13)))
#define TSB_EMA_TMAC_CONFIGURATION_FES            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,14)))
#define TSB_EMA_TMAC_CONFIGURATION_DCRS           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,16)))
#define TSB_EMA_TMAC_CONFIGURATION_JE             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,20)))
#define TSB_EMA_TMAC_CONFIGURATION_JD             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,22)))
#define TSB_EMA_TMAC_CONFIGURATION_WD             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,23)))
#define TSB_EMA_TMAC_CONFIGURATION_CST            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,25)))
#define TSB_EMA_TMAC_CONFIGURATION_TWOKPE         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_CONFIGURATION,27)))
#define TSB_EMA_TMAC_FRAME_FILTER_PR              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,0)))
#define TSB_EMA_TMAC_FRAME_FILTER_HUC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,1)))
#define TSB_EMA_TMAC_FRAME_FILTER_HMC             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,2)))
#define TSB_EMA_TMAC_FRAME_FILTER_DAIF            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,3)))
#define TSB_EMA_TMAC_FRAME_FILTER_PM              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,4)))
#define TSB_EMA_TMAC_FRAME_FILTER_DBF             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,5)))
#define TSB_EMA_TMAC_FRAME_FILTER_SAIF            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,8)))
#define TSB_EMA_TMAC_FRAME_FILTER_SAF             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,9)))
#define TSB_EMA_TMAC_FRAME_FILTER_HPF             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,10)))
#define TSB_EMA_TMAC_FRAME_FILTER_VTFE            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,16)))
#define TSB_EMA_TMAC_FRAME_FILTER_RA              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TMAC_FRAME_FILTER,31)))
#define TSB_EMA_MII_ADDRESS_GB                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MII_ADDRESS,0)))
#define TSB_EMA_MII_ADDRESS_GW                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MII_ADDRESS,1)))
#define TSB_EMA_FLOW_CONTROL_FCA_BPA              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->FLOW_CONTROL,0)))
#define TSB_EMA_FLOW_CONTROL_TFE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->FLOW_CONTROL,1)))
#define TSB_EMA_FLOW_CONTROL_RFE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->FLOW_CONTROL,2)))
#define TSB_EMA_FLOW_CONTROL_UP                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->FLOW_CONTROL,3)))
#define TSB_EMA_FLOW_CONTROL_DZPQ                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->FLOW_CONTROL,7)))
#define TSB_EMA_VLAN_TAG_ETV                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_TAG,16)))
#define TSB_EMA_VLAN_TAG_VTIM                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_TAG,17)))
#define TSB_EMA_VLAN_TAG_ESVL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_TAG,18)))
#define TSB_EMA_VLAN_TAG_VTHM                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_TAG,19)))
#define TSB_EMA_DEBUG_RPESTS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,0)))
#define TSB_EMA_DEBUG_RWCSTS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,4)))
#define TSB_EMA_DEBUG_TPESTS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,16)))
#define TSB_EMA_DEBUG_TXPAUSED                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,19)))
#define TSB_EMA_DEBUG_TWCSTS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,22)))
#define TSB_EMA_DEBUG_TXFSTS                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->DEBUG,24)))
#define TSB_EMA_PMT_CONTROL_STATUS_PWRDWN         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,0)))
#define TSB_EMA_PMT_CONTROL_STATUS_MGKPKTEN       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,1)))
#define TSB_EMA_PMT_CONTROL_STATUS_RWKPKTEN       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,2)))
#define TSB_EMA_PMT_CONTROL_STATUS_MGKPRCVD       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,5)))
#define TSB_EMA_PMT_CONTROL_STATUS_RWKPRCVD       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,6)))
#define TSB_EMA_PMT_CONTROL_STATUS_GLBLUCAST      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,9)))
#define TSB_EMA_PMT_CONTROL_STATUS_RWKPFE         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,10)))
#define TSB_EMA_PMT_CONTROL_STATUS_RWKFILTRST     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PMT_CONTROL_STATUS,31)))
#define TSB_EMA_INTERRUPT_STATUS_PMTIS            (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,3)))
#define TSB_EMA_INTERRUPT_STATUS_MMCIS            (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,4)))
#define TSB_EMA_INTERRUPT_STATUS_MMCRXIS          (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,5)))
#define TSB_EMA_INTERRUPT_STATUS_MMCTXIS          (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,6)))
#define TSB_EMA_INTERRUPT_STATUS_MMCRXIPIS        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,7)))
#define TSB_EMA_INTERRUPT_STATUS_TSIS             (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_STATUS,9)))
#define TSB_EMA_INTERRUPT_MASK_PMTIM              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_MASK,3)))
#define TSB_EMA_INTERRUPT_MASK_TSIM               (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_MASK,9)))
#define TSB_EMA_MAC_ADDRESS0_HIGH_AE              (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS0_HIGH,31)))
#define TSB_EMA_MAC_ADDRESS1_HIGH_SA              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS1_HIGH,30)))
#define TSB_EMA_MAC_ADDRESS1_HIGH_AE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS1_HIGH,31)))
#define TSB_EMA_MAC_ADDRESS2_HIGH_SA              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS2_HIGH,30)))
#define TSB_EMA_MAC_ADDRESS2_HIGH_AE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS2_HIGH,31)))
#define TSB_EMA_MAC_ADDRESS3_HIGH_SA              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS3_HIGH,30)))
#define TSB_EMA_MAC_ADDRESS3_HIGH_AE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_ADDRESS3_HIGH,31)))
#define TSB_EMA_WDOG_TIMEOUT_PWE                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->WDOG_TIMEOUT,16)))
#define TSB_EMA_MMC_CONTROL_CNTRST                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,0)))
#define TSB_EMA_MMC_CONTROL_CNTSTOPRO             (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,1)))
#define TSB_EMA_MMC_CONTROL_RSTONRD               (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,2)))
#define TSB_EMA_MMC_CONTROL_CNTFREEZ              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,3)))
#define TSB_EMA_MMC_CONTROL_CNTPRST               (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,4)))
#define TSB_EMA_MMC_CONTROL_CNTPRSTLVL            (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,5)))
#define TSB_EMA_MMC_CONTROL_UCDBC                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_CONTROL,8)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_RXGBFRMIS   (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT,0)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_RXCRCERFIS  (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT,5)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_RXALGNERFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT,6)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_RXUCGFIS    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT,17)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_RXFOVFIS    (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT,21)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT,13)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_TXSCOLGFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT,14)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_TXMCOLGFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT,15)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_TXGFRMIS   (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT,21)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_MASK_RXGBFRMIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT_MASK,0)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_MASK_RXCRCERFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT_MASK,5)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_MASK_RXALGNERFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT_MASK,6)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_MASK_RXUCGFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT_MASK,17)))
#define TSB_EMA_MMC_RECEIVE_INTERRUPT_MASK_RXFOVFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_RECEIVE_INTERRUPT_MASK,21)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_MASK_TXUFLOWERFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT_MASK,13)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_MASK_TXSCOLGFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT_MASK,14)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_MASK_TXMCOLGFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT_MASK,15)))
#define TSB_EMA_MMC_TRANSMIT_INTERRUPT_MASK_TXGFRMIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_TRANSMIT_INTERRUPT_MASK,21)))
#define TSB_EMA_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_IPC_RECEIVE_INTERRUPT_MASK,12)))
#define TSB_EMA_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_IPC_RECEIVE_INTERRUPT_MASK,13)))
#define TSB_EMA_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_IPC_RECEIVE_INTERRUPT,12)))
#define TSB_EMA_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MMC_IPC_RECEIVE_INTERRUPT,13)))
#define TSB_EMA_VLAN_INCL_REG_VLP                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_INCL_REG,18)))
#define TSB_EMA_VLAN_INCL_REG_CSVL                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->VLAN_INCL_REG,19)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSENA           (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,0)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSCFUPDT        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,1)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSINIT          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,2)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSUPDT          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,3)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSTRIG          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,4)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSADDREG        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,5)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSENALL         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,8)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSCTRLSSR       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,9)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSVER2ENA       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,10)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSIPENA         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,11)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSIPV6ENA       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,12)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSIPV4ENA       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,13)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSEVNTENA       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,14)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSMSTRENA       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,15)))
#define TSB_EMA_TIMESTAMP_CONTROL_TSENMACADDR     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_CONTROL,18)))
#define TSB_EMA_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->SYSTEM_TIME_NANOSECONDS_UPDATE,31)))
#define TSB_EMA_TARGET_TIME_NANOSECONDS_TRGTBUSY  (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TARGET_TIME_NANOSECONDS,31)))
#define TSB_EMA_TIMESTAMP_STATUS_TSSOVF           (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_STATUS,0)))
#define TSB_EMA_TIMESTAMP_STATUS_TSTARGT0         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_STATUS,1)))
#define TSB_EMA_TIMESTAMP_STATUS_TSTRGTERR0       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_STATUS,3)))
#define TSB_EMA_TIMESTAMP_STATUS_TSTARGT1         (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_STATUS,4)))
#define TSB_EMA_TIMESTAMP_STATUS_TSTRGTERR1       (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->TIMESTAMP_STATUS,5)))
#define TSB_EMA_PPS_CONTROL_PPSEN0                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->PPS_CONTROL,4)))
#define TSB_EMA_PPS1_TARGET_TIME_NANOSECONDS_TRGTBUSY1 (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->PPS1_TARGET_TIME_NANOSECONDS,31)))
#define TSB_EMA_BUS_MODE_SWR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,0)))
#define TSB_EMA_BUS_MODE_DA                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,1)))
#define TSB_EMA_BUS_MODE_ATDS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,7)))
#define TSB_EMA_BUS_MODE_FB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,16)))
#define TSB_EMA_BUS_MODE_USP                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,23)))
#define TSB_EMA_BUS_MODE_PBLX8                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,24)))
#define TSB_EMA_BUS_MODE_AAL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,25)))
#define TSB_EMA_BUS_MODE_MB                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,26)))
#define TSB_EMA_BUS_MODE_TXPR                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->BUS_MODE,27)))
#define TSB_EMA_STATUS_TI                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,0)))
#define TSB_EMA_STATUS_TPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,1)))
#define TSB_EMA_STATUS_TU                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,2)))
#define TSB_EMA_STATUS_TJT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,3)))
#define TSB_EMA_STATUS_OVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,4)))
#define TSB_EMA_STATUS_UNF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,5)))
#define TSB_EMA_STATUS_RI                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,6)))
#define TSB_EMA_STATUS_RU                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,7)))
#define TSB_EMA_STATUS_RPS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,8)))
#define TSB_EMA_STATUS_RWT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,9)))
#define TSB_EMA_STATUS_ETI                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,10)))
#define TSB_EMA_STATUS_FBI                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,13)))
#define TSB_EMA_STATUS_ERI                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,14)))
#define TSB_EMA_STATUS_AIS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,15)))
#define TSB_EMA_STATUS_NIS                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,16)))
#define TSB_EMA_STATUS_GMI                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,27)))
#define TSB_EMA_STATUS_GPI                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,28)))
#define TSB_EMA_STATUS_TTI                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->STATUS,29)))
#define TSB_EMA_OPERATION_MODE_SR                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,1)))
#define TSB_EMA_OPERATION_MODE_OSF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,2)))
#define TSB_EMA_OPERATION_MODE_DGF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,5)))
#define TSB_EMA_OPERATION_MODE_FUF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,6)))
#define TSB_EMA_OPERATION_MODE_FEF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,7)))
#define TSB_EMA_OPERATION_MODE_ST                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,13)))
#define TSB_EMA_OPERATION_MODE_FTF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,20)))
#define TSB_EMA_OPERATION_MODE_TSF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,21)))
#define TSB_EMA_OPERATION_MODE_DFF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,24)))
#define TSB_EMA_OPERATION_MODE_RSF                (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,25)))
#define TSB_EMA_OPERATION_MODE_DT                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->OPERATION_MODE,26)))
#define TSB_EMA_INTERRUPT_ENABLE_TIE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,0)))
#define TSB_EMA_INTERRUPT_ENABLE_TSE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,1)))
#define TSB_EMA_INTERRUPT_ENABLE_TUE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,2)))
#define TSB_EMA_INTERRUPT_ENABLE_TJE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,3)))
#define TSB_EMA_INTERRUPT_ENABLE_OVE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,4)))
#define TSB_EMA_INTERRUPT_ENABLE_UNE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,5)))
#define TSB_EMA_INTERRUPT_ENABLE_RIE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,6)))
#define TSB_EMA_INTERRUPT_ENABLE_RUE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,7)))
#define TSB_EMA_INTERRUPT_ENABLE_RSE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,8)))
#define TSB_EMA_INTERRUPT_ENABLE_RWE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,9)))
#define TSB_EMA_INTERRUPT_ENABLE_ETE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,10)))
#define TSB_EMA_INTERRUPT_ENABLE_FBE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,13)))
#define TSB_EMA_INTERRUPT_ENABLE_ERE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,14)))
#define TSB_EMA_INTERRUPT_ENABLE_AIE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,15)))
#define TSB_EMA_INTERRUPT_ENABLE_NIE              (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->INTERRUPT_ENABLE,16)))
#define TSB_EMA_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISCNTOVF (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER,16)))
#define TSB_EMA_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER,28)))
#define TSB_EMA_AHB_STATUS_AHSTS                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_EMA->AHB_STATUS,0)))
#define TSB_EMA_MAC_CTRL0_CLK_LM                  (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_CTRL0,4)))
#define TSB_EMA_MAC_CTRL1_TXCLKEN                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_CTRL1,0)))
#define TSB_EMA_MAC_CTRL1_RXCLKEN                 (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_CTRL1,1)))
#define TSB_EMA_MAC_CTRL1_RMIICLKEN               (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_CTRL1,2)))
#define TSB_EMA_MAC_CTRL2_SRST                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_EMA->MAC_CTRL2,0)))


